Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སྟེགས་བུ་ལ་ལ་ལ་ནི་བྱུག་པ་འདོད་པའི་སེམས་ཅན་རྣམས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྤྱོད་དུ་གཟུང་པའི་ཕྱིར། །ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་རྣམ་པ་ཁ་དོག་དང་། དྲི་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་དང་ལྡན་པ་དག་ཀྱང་བཀོད་པར་གྱུར་ཏོ། །
en: “On some platforms were arranged all kinds of divine aromatic substances, with various colors and aromas, for those who wished to perfume themselves to enjoy in accordance with their wishes.

source: སྟེགས་སུ་བུ་ལ་ལ་ལ་ནི་སེམས་ཅན་རྣམས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྤྱོད་དུ་གཟུད་པའི་ཕྱིར་ཡོ་བྱད་ཐམས་ཅད་ཀྱི་ཕུང་པོ་དག་ཀྱང་བཀོད་པར་གྱུར་ཏོ། །སྟེགས་བུ་ལ་ལ་ལ་ནི་ན་ཆུང་གཟུགས་བཟང་བ་རབ་ཏུ་མཛེས་པ་ཤིན་ཏུ་སྡུག་པ།
en: “On some platforms, heaps of various artifacts had been arranged for beings to enjoy in accordance with their wishes.

source: ཆ་ལུགས་སྡུག་གུ་སྣ་ཚོགས་དང་ལྡན་པ་ཡིད་དུ་འོང་བའི་གོས་སྣ་ཚོགས་གྱོན་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་མཛེས་པར་བརྒྱན་པ། བྱུག་པ་སྣ་ཚོགས་ཀྱིས་ཚུལ་སྡུག་གུར་བརྒྱན་ཅིང་མཛེས་པར་བྱས་པའི་ལུས་དང་ལྡན་པ། བུད་མྱེད་ཀྱི་བཟོ་དང་སྒྱུ་དང་། ཤེས་ཉེན་གྱི་ཚུལ་ལ་མཁས་པ་དག་ཀྱང་བཀོད་པར་གྱུར་ཏོ། །
en: “On some platforms were arranged beautiful, charming, attractive women with a variety of pleasing appearances, their bodies beautified by being dressed in a variety of beautiful clothes, beautifully adorned by every kind of jewelry, perfumed by a variety of scents, and skilled in the female crafts and arts.

source: དེའི་ཚེ་རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་དེ་ཉིད་ན་སྤྲུལ་འཚོང་མའི་དམ་པ་རྒྱལ་པོའི་ལོངས་སྤྱོད་དུ་འོས་པ། བལྟ་ན་མཛེས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ། དེའི་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ཞེས་བྱ་བ་གཟུགས་བཟང་ཞིང་ཤིན་ཏུ་མཛེས་པ། བལྟ་ན་སྡུག་པ་ཧ་ཅང་ཡང་མི་རིང་ཧ་ཅང་ཡང་མི་ཐུང་། ཧ་ཅང་ཡང་མི་སྦོམ། ཧ་ཅང་ཡང་མི་ཕྲ། ཧ་ཅང་ཡང་མི་དཀར། ཧ་ཅང་ཡང་མི་སྔོ་བ། སྐྲ་མཐོན་ཏིང་དུ་འདུག་པ། མྱིག་དཀར་ནག་འབྱེས་པ། བཞིན་ཡིད་དུ་འོང་བ། ཚངས་པའི་དབྱངས་དང་ལྡན་པ། འཇམ་ཞིང་སྙན་པར་སྨྲ་བ། ཤེས་རབ་དང་ལྡན་པ། ཤེས་ཉེན་གྱི་ཚུལ་ཐམས་ཅད་ལ་མཁས་པ་གཙུག་ལག་ཐམས་ཅད་ལ་ཤེས་པ། བརྩོན་པ། ལེ་ལོ་མྱེད་པ། རིམ་འགྲོ་ཡོད་པ། མོས་པ་དང་ལྡན་པ། བྱམས་པའི་སེམས་འདོགས་པ།
en: “At that time, in the royal capital Druma­meru­śrī, there was the preeminent courtesan called Sudarśanā, who was worthy to be enjoyed by the king.

source: ཁོང་ཁྲོ་བ་མི་མངའ་བ། བལྟ་ན་མི་ངོམས་ཤིང་ཡིད་དུ་འོང་བ། འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ཆུང་བ། ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ།
en: She had a daughter named Sucalita­rati­prabhāsa­śrī, who was beautiful, with a lovely body, attractive, not too tall and not too short, not too plump and not too thin, not too white and not too dark, and with deep black hair, deep black eyes, a beautiful face, and a voice like Brahmā’s; who spoke gently and pleasantly, was wise, and was skilled in all the arts; and who knew all treatises, was diligent, was not lazy, was respectful, was gracious, had a kind mind, was not aggressive, was so attractive that one never tired of gazing upon her, had little desire, anger, or ignorance, had a sense of decorum and modesty, was honest and gentle, and had no deceit or trickery.

source: དྲང་ཞིང་མཉེན་པ། གཡོ་དང་སྒྱུ་མེད་པ་ཞིག་ཡོད་དེ། དེ་མ་དང་ལྷན་ཅིག་ཏུ་བུ་མོ་དུ་མ་ཞིག་གིས་ཡོངས་སུ་བསྐོར་ཏེ། རིན་པོ་ཆེའི་ཤིང་རྟ་ལ་ཞོན་ནས་རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་ནས་བྱུང་སྟེ།
en: “She mounted a precious carriage with her mother and accompanied by many girls, and they came out from Druma­meru­śrī.

source: རྒྱལ་པོས་བཀའ་སྩལ་ནས། རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་མདུན་ནས། ཕར་རྒྱལ་བུ་གཞོན་ནུ་དེ་གླུ་ལེན་ཞིང་འདོང་འདོང་བ་ལས།
en: At the king’s command, they sought out the young prince Tejodhipati so as to sing before him.

source: རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་མཐོང་ནས། འདོད་ཆགས་ཀྱིས་སེམས་ཤིན་ཏུ་མི་བཟང་པ་ཞིག་གཡོས་ཏེ།
en: “When Sucalita­rati­prabhāsa­śrī saw Prince Tejodhipati, her mind was shaken by overwhelming desire.

source: རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ཤིན་ཏུ་ཡིད་དུ་འོང་ཆེས་ནས་རྗེས་སུ་འབྲང་ཞིང་སེམས་ལ་རང་དབང་མེད་པས། བལྟ་ན་སྡུག་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The beauty of Prince Tejodhipati was so great she helplessly followed him.

source: མ་འདི་ལྟར་མཁྱེན་པར་མཛོད་ཅིག །གལ་ཏེ་བདག་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་མ་བཏད་ན་ནི་འགུམ་པ་འམ།
en: “She said to her mother Sudarśanā, ‘Mother, know this: I will die if I am not given to this Prince Tejodhipati!

source: སྲོག་ལ་འབབ་པའི་སྡུག་བསྔལ་གཅིག་ཏུ་འགྱུར་རོ།
en: The suffering will bring me to death!’

source: དེས་སྨྲས་པ། བུ་མོ་དེ་ལྟ་བུའི་སེམས་མ་སྐྱེད་ཅིག །
en: Sudarśanā replied, ‘My daughter, don’t have such an aspiration!

source: གཞོན་ནུ་འདི་ནི་འཁོར་ལོས་སྒྱུར་བའི་མཚན་དང་ལྡན་པ་སྟེ།
en: This youth has the signs of a cakravartin.

source: དེའི་ཡབ་ནོར་གྱི་བདག་པོ་མི་བཞུགས་པར་གྱུར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ལ་གནས་པར་འགྱུར་བའི་གནས་ཡོད་དོ། །
en: When his father Dhanapati is no longer with us, he will rule a cakravartin’s kingdom.

source: དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བས། དེའི་བུད་མེད་རིན་པོ་ཆེ་ནམ་མཁའ་ལ་འགྲོ་བ་འབྱུང་བར་འགྱུར་ལ།
en: When he has become a cakravartin, he will have a precious queen who will come flying through the air.

source: བུ་མོ་བདག་ཅག་ཀྱང་། སྦྲུལ་འཚོང་མ་དག་ཅིག་སྟེ། འཇིག་རྟེན་ཐམས་ཅད་དགའ་བར་བྱེད་པ་ཡིན་གྱི།
en: My daughter, we are courtesans who bring pleasure to the entire world.

source: ཡུ་བུས་སེམས་ཅན་འགའ་ཞིག་ལ་ནམ་འཚོའི་བར་དུ་བསྙེན་བཀུར་མྱི་བྱར་མྱི་རུང་བའང་མྱེད་དེ།
en: We do not and cannot remain throughout our lifetime serving only one being.

source: ཡུ་བུ་ནི་རྒྱལ་པོ་ནོར་གྱི་བདག་པོའི་བཀས་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་རིམ་འགྲོར་འདོང་འདོང་བར་ཟད་ཀྱིས་དེ་ལྟ་བུའི་སེམས་བརྟན་པར་མ་བྱེད་ཅིག །
en: King Dhanapati commanded us to come before the young prince Tejodhipati only to show our respect!

source: གནས་དེ་ནི་ཐོབ་པར་ཡང་ཤིན་ཏུ་དཀའོ། །
en: That kind of status would be too difficult to attain.’

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐུ་ཉི་མ་དམ་པ་ཞེས་བྱ་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པར་བླ་ན་མྱེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་ལྷ་དང་། མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “At that time, in that world there appeared a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, who was named Sūrya­gātra­pravara.

source: དེའི་སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀྱི་སྤྲིན་ཤིན་ཏུ་སྡུག་པའི་འོད་ཅེས་བྱ་བ་ཡང་བཟའ་ཤིང་གི་ར་བ་སྤོས་ཀྱི་མྱུ་གུའི་རྩེ་མོ་ལས་འོད་ཀྱི་སྤྲིན་འབྱུང་བ་ཞེས་བྱ་བ་དེའི་ནང་དུ་བྱུང་སྟེ།
en: “His bodhimaṇḍa, called Dharma­meghodgata­prabhā, was near to the Gandhāṅkura­prabha­megha Park.

source: དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་ཐོག་མར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: It had been seven days since the Bhagavat, the Tathāgata Sūrya­gātra­pravara had attained complete buddhahood there.

source: ཞག་བདུན་ལོན་པ་དེ་བུ་མོ་དེ་ཤིང་རྟ་ལ་ཞོན་བཞིན་དུ་ཡུར་ཞིང་འཆོག་འཆོག་པའི་རྨི་ལམ་དུ་མཐོང་ནས་སད་པར་གྱུར་པ་དང་། སྔོན་གཉེན་བཤེས་སུ་གྱུར་པའི་ལྷ་མོ་ཞིག་གིས་བསྟན་པ།
en: The girl, while in her carriage, nodded off to sleep and saw him in a dream.

source: བུ་མོ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཉི་མ་དམ་པ་དེ་ནི་སྙིང་བོ་བྱང་ཆུབ་ཆོས་ཀྱི་སྤྲིན་ཤིན་ཏུ་སྡུག་པའི་འོད་ཅེས་བྱ་བ་ན་རྣམ་པར་སྤྱོད་ཅིང་ཐོག་མ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཞག་བདུན་ལོན་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: When she woke up, a goddess, who in past times had been a relative, declared to her, ‘Girl, the Tathāgata Sūrya­gātra­pravara is present in the Dharma­meghodgata­prabhā bodhimaṇḍa, after his first seven days since attaining complete buddhahood.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཚངས་པ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མྱིན་གྱི་ལྷའི་ཚོགས་ཀྱིས་མདུན་དུ་བྱས་ཤིང་བཞུགས་ཏེ།
en: He is encircled by an assembly of bodhisattvas, and before him are gathered assemblies of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Brahmakāyika deities, Ābhāsvara deities, and Akaniṣṭha deities.

source: དེར་སའི་ལྷ་མོ་ཐམས་ཅད་ཀྱང་ཀུན་ནས་འདུས། ཆུའི་ལྷ་མོ་དང་། མྱེའི་ལྷ་མོ་དང་། རླུང་གི་ལྷ་མོ་དང་། རྒྱ་མཚོའི་ལྷ་མོ་དང་། ཆུ་ཀླུང་གི་ལྷ་མོ་དང་། རིའི་ལྷ་མོ་དང་། མཚན་མོའི་ལྷ་མོ་དང་། སྐྱ་རེངས་འཆར་བའི་ལྷ་མོ་དང་། ནགས་ཚལ་གྱི་ལྷ་མོ་དང་། ཤིང་གི་ལྷ་མོ་དང་། སྨན་གྱི་ལྷ་མོ་དང་། ལོ་ཐོག་གི་ལྷ་མོ་དང་། གྲོང་ཁྱེར་གྱི་ལྷ་མོ་དང་། རྐང་གིས་འགྲོ་བའི་ལྷ་མོ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་དང་། ལུས་ཀྱི་འོད་གཟེར་གྱི་ལྷ་མོ་དང་། སེམས་ཅན་གྱི་རིས་ཀྱི་ལྷ་མོ་དང་། ནམ་མཁའི་ལྷ་མོ་དང་། ཕྱོགས་ཐམས་ཅད་ཀྱི་ལྷ་མོ་དག་ཀྱང་བཅོམ་ལྡན་འདས་སྐུ་ཉི་མ་དམ་པའི་ཞལ་བལྟ་བའི་ཕྱིར་ཀུན་ནས་འདུས་སོ་ཞེས་ནས།
en: Also gathered there to gaze upon the Tathāgata Sūrya­gātra­pravara are all goddesses of the earth, goddesses of water, goddesses of fire, goddesses of the air, goddesses of the oceans, goddesses of the rivers, goddesses of the mountains, goddesses of the night, goddesses of the dawn, goddesses of the forests, goddesses of the trees, goddesses of herbs, goddesses of harvests, goddesses of towns, goddesses of footpaths, goddesses of the bodhimaṇḍas, goddesses of the body’s light rays, goddesses of classes of beings, goddesses of the sky, and goddesses from all directions.’

source: དེ་ལྟར་དེས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཐོས་པས་བག་ཚ་མྱེད་པ་ཐོབ་པར་གྱུར་ཏེ།
en: “When Sucalita­rati­prabhāsa­śrī had seen the Tathāgata and heard of the qualities of the Tathāgata, she attained a state of serenity.

source: སྐབས་སུ་བབ་ནས་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་མདུན་དུ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །གཟུགས་ཀྱི་མཆོག་གིས་འཇིག་རྟེན་ཁྱད་པར་འཕགས། །
en: When the opportunity came, she recited these verses before Prince Tejodhipati: “ ‘I am preeminent in this world because of my excellent body.

source: ཡོན་ཏན་རྣམས་ཀྱིས་ཐམས་ཅད་ཕྱོགས་སུ་གྲགས། །
en: My qualities are renowned in all directions.

source: ཤེས་རབ་སྟོབས་ཀྱིས་བདག་དང་འདྲ་མ་མཆིས། །
en: Because of the power of my wisdom, there is no one like me.

source: སྒྱུ་རྩལ་དགའ་བ་སྒྱུ་མའི་ཚུལ་ཀུན་འཚལ། །
en: I am learned in all the arts and skills of pleasure.

source: སྲོག་ཆགས་མང་པོ་སྟོང་ཕྲག་དུ་མ་ཡིས། །འདོད་ཆགས་དབང་གིས་བདག་ལ་རབ་བལྟས་ཀྱང་། །
en: {1} “ ‘There are many thousands of beings Who gaze upon me with desire.

source: གཞོན་ནུ་བདག་ནི་འཇིག་རྟེན་གང་ལ་ཡང་། །གློ་བ་ཆགས་པར་གྱུར་པ་གཅིག་མ་མཆིས། །
en: Prince, I have had no desire within me For anyone in this world.

source: སེམས་ཅན་གང་ལ་ཡང་ཞེན་པར་གྱུར་པ་འམ། །
en: {2} “ ‘I have no attachment toward any being.

source: གང་ལའང་ཁོང་ཁྲོར་བདག་གི་སེམས་མ་གྱུར། །
en: In my mind there is no anger toward anyone.

source: གང་ལའང་དགྲ་མྱི་བགྱིད་དེ་ཞེ་མྱི་སྡང་། །
en: No one is my enemy, and I have no hatred.

source: བདག་ནི་སེམས་ཅན་སྨན་པར་དགའ་བ་ལགས། །
en: In my mind there is only delight in benefiting beings.

source: སྐུ་གཞན་སྐུ་མཆོག་ཡོན་ཏན་རབ་མངའ་ཁྱོད། །གང་ཚེ་བདག་གིས་གསལ་བར་མཐོང་གྱུར་པ། །དེ་ཚེ་དབང་པོ་ཀུན་ཀྱང་ཉམས་སུ་བདེ། །
en: {3} “ ‘When, Prince, I clearly saw You who have a supreme body with excellent qualities, All my senses experienced bliss.

source: རྒྱ་ཆེ་ཡངས་པར་ཤིན་ཏུ་དགའ་བར་གྱུར། །
en: There arose within me a vast, great bliss.

source: ཁྱོད་ཀྱི་དབུ་བཟང་ལྕང་ལོར་འཁྲིལ་བ་ནི། །རིན་ཆེན་རྣམ་སྣང་མདོག་ཏུ་མཐོན་ཏིང་གསལ། །
en: {4} “ ‘Your coiled hair upon your excellent head Is deep blue like the color of a shining jewel.

source: ཞལ་གྱི་སྨིན་སྡུག་འཕྲལ་བ་ཤངས་སུ་མཛེས། །
en: You have lovely eyebrows and a beautiful nose.

source: ཁྱོད་ཀྱི་ཞལ་སྔར་ལུས་འདི་བདག་འབུལ་ལོ། །
en: In your presence I offer you my body.

source: མཚན་གྱི་རབ་འཆང་གཟི་བརྗིད་ཆེ་མངའ་བ། །
en: {5} “ ‘You have the supreme signs; you have excellent radiance.

source: སྐུ་གཟུགས་གསེར་གྱི་རི་བོ་བཟང་པོ་འདྲ། །
en: Your body is like an excellent mountain of gold.

source: ཁྱོད་ཀྱི་སྤྱན་སྔར་བདག་ལྟ་མི་མཛེས་ཏེ། །ཟིལ་དུ་རླག་པས་སྣག་ཚའི་གཟུགས་ཀྱང་འདྲ། །
en: In your presence, compared to you I have no beauty; I am outshone and resemble a solid lump of ink.

source: སྤྱན་གསལ་རིང་ལ་དཀར་ནག་འབྱེས་པས་མཛེས། །
en: {6} “ ‘Your clear eyes are long, with contrasting white and black.

source: ཤིན་ཏུ་ཞལ་རྒྱས་སེང་གེའི་ཟ་འགྲམ་ཅན། །
en: You have a wide face and the cheeks and jaws of a lion.

source: ཁྱོད་ཀྱི་གསུང་ནི་ཐོགས་པ་མ་མཆིས་ན། །
en: Your speech is free of any impediment.

source: གསུང་མཆོག་མངའ་བས་བདག་ནི་གཟུང་དུ་གསོལ། །
en: I pray that you, who have the supreme speech, take me.

source: ཁྱོད་ཀྱི་ཞལ་ན་ལྗགས་ཡངས་མངའ་བ་ནི། །
en: {7} “ ‘You have a wide tongue within your mouth.

source: མདོག་དམར་ཡངས་པ་རིན་ཆེན་མཆོག་གི་འོད། །
en: It is wide and red, with the excellent light of a jewel.

source: ཚངས་དབྱངས་ཡན་ལག་མཆོག་གི་གསུང་མངའ་བས། །
en: You possess speech with the supreme aspects of Brahmā’s voice.

source: གསུང་ཞིང་འགྲོ་བ་རབ་ཏུ་དགའ་བ་མཛད། །
en: When you speak, you bring delight to beings.

source: ཁྱོད་ཀྱི་ཞལ་ན་ཐགས་བཟང་ཚེམས་མངའ་བ། །དུང་ལྟར་དྲི་མེད་ཤིན་ཏུ་རྣམ་པར་གསལ། །
en: {8} “ ‘You have even rows of teeth in your mouth, Very bright and stainless, like conches.

source: འཛུམ་ཞིང་བཞད་པ་རྣམ་པར་སྟོན་མཛད་ཀྱང་། །སྐྱེས་བུ་དཔལ་ཁྱོད་འགྲོ་བ་དགའ་བར་མཛད། །
en: When you show them in smiling or talking, You, glorious man, bring joy to beings.

source: ཁྱོད་ཀྱི་སྐུ་ལ་མཚན་རབ་མཛེས་པ་རྣམས། །སུམ་ཅུ་རྩ་གཉིས་དག་ཅིང་འོད་ཀྱང་གསལ། །སྐུ་གཟུགས་བཟང་པོ་ཡོངས་སུ་དེས་བརྒྱན་པས། །
en: {9} “ ‘Your body is beautified by the thirty-two Supreme signs, and it shines brightly.

source: མི་ཡི་དབང་པོ་འཁོར་ལོས་སྒྱུར་བ་བྱོན། །
en: As your body is adorned by those signs, Lord of humans, you will be a cakravartin.’

source: དེ་ནས་རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོས། བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་མོ་ཁྱོད་སུའི།
en: {10} “Then Prince Tejodhipati asked Sucalita­rati­prabhāsa­śrī, ‘Girl, who are you?

source: ཁྱོད་ལ་ཡོངས་སུ་སྲུང་བ་ནི་གང་ཞིག་ཡོད།
en: Who is your guardian?

source: བུ་མོ་ང་ལ་ནི་གཞན་གྱིས་ཡོངས་སུ་གཟུང་བའི་བུད་མེད་བདག་གིར་བྱར་མི་རུང་ངོ་ཞེས་ནས།
en: I cannot take as my own a woman who belongs to another.’

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་སྨྲས་སོ། །བལྟ་སྡུག་གཟུགས་ཀྱི་ཡོན་ཏན་ལེགས་ལྡན་པ། །མཚན་བཟང་བསོད་ནམས་རྣམ་པར་དག་པའི་ལུས། །ཁྱོད་ལ་དྲི་བའི་དོན་འདི་ང་ལ་སྨྲོས། །ལུས་མཆོག་ཁྱོད་ནི་སུ་ཡིས་ཡོངས་སུ་གཟུང་། །
en: Then at that time he recited these verses: “ ‘You who are beautiful with excellent physical qualities, Who have a pure body of merit with excellent signs, Give your answer to these questions I ask you: To whom do you, who have a perfect body, belong?

source: ཁྱོད་ལ་ཕ་དང་མ་ནི་ཡོད་དམ་མྱེད། །
en: {11} “ ‘Do you have a father and mother or not?

source: ཁྱིམ་ཐབ་མྱེད་དམ་ཁྱོད་ནི་སུ་ཞིག་དབང་། །
en: Are you unmarried, or who has authority over you?

source: གཟུགས་མཛེས་ཁྱོད་ལ་སེམས་ཅན་གཞན་ནམ་གཅིག །བདག་གི་ཡིན་པར་འདུ་ཤེས་བྱེད་མྱེད་དམ། །
en: You who have a beautiful body, should I perceive you As belonging to some other being or see you as mine?

source: ཁྱོད་ཀྱི་ཡིད་ནི་གསོད་ལ་མྱི་དགའ་འགྲང་། །
en: {12} “ ‘In your mind you do not delight in killing?

source: གཞན་ལས་མ་བྱིན་ཕྲོགས་པར་མི་བྱེད་དམ། །
en: You do not take from others what is not given?

source: འདོད་པས་ལོག་པར་གཡེམ་ལ་མྱི་དགའ་འགྲང་། །
en: You do not delight in sexual misconduct?

source: བརྫུན་དུ་བརྗོད་སྨྲར་ཡིད་ནི་མི་མོས་སམ། །
en: You do not wish in your mind to speak lies?

source: ཁྱོད་ཀྱི་བློ་གྲོས་མཛའ་འབྱེད་མི་འཇུག་གམ། །
en: {13} “ ‘You do not use your intelligence to separate friends?

source: ཚིག་བརླང་གཞན་ལ་གནོད་པར་མྱི་སྨྲ་འགྲང་། །
en: You do not speak harmful words out of anger?

source: གཞན་གྱི་ནོར་ལ་ཆགས་པར་སེམས་མྱེད་དམ། །
en: You do not have a mind that craves the wealth of others?

source: འགྲོ་བ་རྣམས་ལ་གནོད་པར་མྱི་སེམས་འགྲང་། །
en: You do not intend to cause harm to others?

source: བལྟ་བའི་འབྲོག་དགོན་ལམ་དུ་མ་ཞུགས་འགྲང་། །
en: {14} “ ‘You do not enter the pathways into the wilderness of wrong views?

source: ལས་ཀྱི་རྒྱུད་ལ་ཡེ་བརྡམ་སེམས་མྱེད་དམ། །
en: You are not without restraint in terms of the different kinds of karma?

source: གཡོ་མདོག་སྒྱུ་ཡི་དབང་དུ་མི་འགྲོའམ། །
en: Do you not fall under the power of deceit and trickery?

source: མི་འཐད་འཇིག་རྟེན་གནོད་པར་མྱི་བྱེད་འགྲང་། །
en: Do you not cause wicked harm in the world?

source: ཕ་མ་གཉེན་དང་མཛའ་བཤེས་བླ་མ་ལ། །
en: {15} “ ‘Are you affectionate and respectful To father, mother, relatives, friends, and gurus?

source: སྲི་ཞུ་རིམ་གྲོར་བྱ་བའི་ཚུལ་འཆང་ངམ། །ཕོངས་པར་གྱུར་པ་ཡོངས་སུ་བསྡུ་དོན་དུ། །ཁྱེད་ཀྱི་ཡིད་ལ་བྱིན་པར་སེམས་ཡོད་དམ། །
en: Do you have in your mind the intention to give To gatherings of those who have become destitute?

source: ཆོས་དང་མཐུན་པར་དུས་སུ་འདོམས་བྱེད་ཅིང་། །ལུས་དང་སེམས་ཡིད་ཡོངས་སུ་དག་བྱེད་ལ། །ཡང་དག་ལས་སུ་རུང་བ་སྐྱེད་བྱེད་པའི། །དགེ་བཤེས་རྣམས་ལ་དགའ་བར་སེམས་ཡོད་དམ།
en: {16} “ ‘Do you have the intention to please the good friends Who give you timely advice in accord with the Dharma, Who make the body and the mind tractable So that they may be completely purified?

source: སངས་རྒྱས་རྣམས་ལ་རིམ་གྲོར་བྱེད་ལྡན་ནམ། །
en: {17} “ ‘Do you honor the buddhas?

source: སངས་རྒྱས་སྲས་ལ་དགའ་མཆོག་ཡོད་དམ་མྱེད།
en: Do you have great delight in the bodhisattvas?

source: གང་ལས་བདེ་གཤེགས་སྲས་རྣམས་སྐྱེར་འགྱུར་བའི། །ཆོས་ཀྱི་དམ་པ་དེ་ནི་ཤེས་མི་ཤེས། །
en: Do you or do you not know the supreme Dharma From which are born the sons of the sugatas?

source: ཆོས་ཡིད་མཆོག་ལ་གནས་པར་ཁྱོད་བྱེད་འགྲང་། །
en: {18} “ ‘Do you dwell in a supreme Dharma mind?

source: ཆོས་མིན་སྤྱད་པའི་བློ་གྲོས་མེད་འགྲང་ངོ་། །
en: Do you not have a mind that acts contrary to the Dharma?

source: ལེགས་པ་མཐའ་ཡས་ཡོན་ཏན་རྒྱ་མཚོ་ལ། །གུས་པའི་སྲི་ཞུ་དགའ་སེམས་མཆོག་ཡོད་མ། །
en: Do you have a perfect mind that respectfully delights In the ocean of the qualities of infinite excellence?

source: སྐྱེ་བོ་མགོན་མེད་ཕོངས་པར་གྱུར་པ་ཡི། །འདྲེན་པ་རྣམས་ལ་བྱམས་པའི་ཡིད་ཡོད་དམ། །
en: {19} “ ‘Do you have a kind mind toward those beings Who have no protector, are destitute, and have no guide?

source: ངན་སོང་འགྲོ་བའི་ལམ་ལ་ཞུགས་པ་ཡི། །ཤིན་ཏུ་ཉམ་ཐག་སྙིང་རྗེ་སེམས་འགྲང་ངོ་། །
en: Do you have compassion in your mind for those unfortunate ones Who have entered the path that leads to the lower existences?

source: གཞན་གྱི་ཕུན་སུམ་ཚོགས་པ་མཐོང་གྱུར་ན། །ཁྱོད་ནི་དགའ་བ་མཆོག་དང་ལྡན་འགྱུར་རམ། །
en: {20} “ ‘Do you have perfect rejoicing When you see the good fortune of others?

source: སྐྱེ་བོ་ཉོན་མོངས་རྣམས་ཀྱིས་འཁོལ་གྱུར་ལ། །ཤེས་རབ་མཐུ་བསྐྱེད་བཏང་སྙོམས་བྱེད་མི་བྱེད། །
en: When beings are enslaved by their kleśas, Do you have equanimity through the power of wisdom, or not?

source: མྱི་ཤེས་གཉིད་ལོག་སྐྱེ་བོ་མང་མཐོང་ན། །བྱང་ཆུབ་དམ་པར་སྨོན་ལམ་འདེབས་བྱེད་འགྲོང་། །
en: {21} “ ‘When you see many beings in the sleep of ignorance, Do you pray that they will attain perfect enlightenment?

source: བསྐལ་པ་མཐའ་ཡས་སྤྱད་པ་སྤྱོད་བྱེད་ན། །སྨོན་ལམ་དམ་པས་སྐྱོ་བར་མི་འགྱུར་འགྲང་། །
en: Are you not disheartened by the supreme prayer To practice bodhisattva conduct for endless kalpas?’

source: དེ་ནས་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པའི་མ་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པས་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་བདག་གི་བུ་མོ་འདི་ནི་རྫུས་ཏེ་བྱུང་བ། པད་མོའི་ནང་ནས་སྐྱེས་པ་སྟེ།
en: {22} “Then Sudarśanā, the preeminent courtesan, who was the mother of the girl Sucalita­rati­prabhāsa­śrī, said to the young prince Tejodhipati, ‘Prince, this daughter of mine had a miraculous birth; she was born from inside a lotus.

source: སྔན་ཆད་ཁྱིམ་གྱི་ནང་ནས་ཕྱི་རོལ་ཏུ་མ་བྱུང་ངོ་ཞེས་ནས།
en: She has not until now been outside of her home.’

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཅེས་སྨྲས་སོ། །བུ་མོ་འདི་ལ་ཁྱོད་ཀྱིས་གང་སྨྲས་པ། །དེ་ནི་བདག་གིས་རིམ་པས་ཁྱོད་ལ་བརྗོད། །
en: Then at that time she recited these verses: “ ‘I will give you, in order, the answers To the questions you have asked this girl.

source: ཇི་ལྟར་བུ་མོ་འདི་སྐྱེས་བསྐྱེད་བསྐྱེད་པ། །བདག་གིས་ཁྱོད་ལ་གསོལ་གྱིས་གསན་དུ་གསོལ། །
en: I request you to listen, for I shall relate to you The way in which the birth of this girl occurred.

source: གང་ཚེ་དགུང་སངས་ཁྱོད་ནི་བལྟམ་གྱུར་པ། །དེ་ཚེ་བདག་གི་བུ་མོ་འདི་སྐྱེས་ཏེ། །
en: {23} “ ‘At the end of the night when you were born, At that same time this daughter of mine was born.

source: རྫུས་ཏེ་དྲི་མེད་པད་མའི་སྦུབས་ནས་བྱུང་། །ཡན་ལག་ཀུན་ཚང་མྱིག་ཡངས་འདི་ཡང་སྐྱེས། །
en: She appeared miraculously from within a stainless lotus, Born with all her limbs complete, with lovely wide eyes.

source: དུས་ཀྱི་ནང་ན་སོས་ཀ་དུས་མཆོག་ལ། །སྨན་དང་ལོ་ཏོག་མྱུ་གུ་འཐོན་པའི་ཚེ། །སཱ་ལའི་ར་བ་བཟའ་ཤིང་རབ་མཆོག་ཏུ། །བདག་ནི་རྩེ་དགའ་དེ་ཁྲོད་མཆི་མཆི་སྟེ། །
en: {24} “ ‘During the best of seasons, the time of spring, When herbs, harvests, and sprouts emerge, I was wandering happily In a perfect park of sal trees.

source: སྣ་ཚོགས་ཡལ་གའི་ལོ་མ་རྒྱས་གྱུར་ཅིང་། །
en: {25} “ ‘Variegated leaves were growing on the branches.

source: ཞུགས་ཤིང་མེ་ཏོག་སྡུག་རྒྱས་སྤྲིན་གྱི་མདོག །
en: The masses of blossoming trees were like clouds.

source: བྱ་བྲན་སྣ་ཚོགས་སྒྲ་སྙན་ཞུགས་ཤིང་ནང་། །
en: Various birds were singing in the trees.

source: ནགས་ཁྲོད་མྱ་ངམ་མ་མཆིས་དགར་མཆིས་མཆིས། །
en: I was happy, joyful, and carefree in the forest.

source: རྒྱན་དང་ལྡན་ཞིང་ཤིན་ཏུ་ཡིད་འོང་ལ། །རིན་ཆེན་རད་པ་སྣ་ཚོགས་འཚལ་པ་རྣམས། །རོལ་མོ་གླུ་ལ་ཤིན་ཏུ་བསླབས་པ་ཡི། །བུ་མོ་བརྒྱ་ཕྲག་བརྒྱད་དང་བདག་ཀྱང་ལྡན། །
en: {26} “ ‘I was accompanied by eight hundred girls Who were adorned and very beautiful, Wearing all kinds of jewels And trained well in music and song.

source: སྤོས་མཆོག་ལྡན་པའི་བུན་ད་རི་ཀ་དང་། །རྫིང་འགྲམ་མེ་ཏོག་སིལ་མས་བལྟམས་པ་ཡི། །ས་ཕྱོགས་དེ་ན་བུད་མྱེད་མང་པོ་དང་། །བདག་ཅག་དེ་ན་དགའ་བར་མཆིས་མཆིས་ན། །
en: {27} “ ‘I, together with the many women, Proceeded joyfully to an area Where there were white lotuses with supreme scents And a pond with banks covered in petals.

source: ཆབ་དབུས་དེ་ནས་རིན་ཆེན་པད་མོའི་མཆོག །འདབ་མ་སྟོང་དང་ལྡན་པ་བྱུང་བར་གྱུར། །
en: {28} “ ‘In the middle of the water there appeared A perfect, precious thousand-petaled lotus.

source: ལོ་མ་རིན་ཆེན་ཡུ་བ་བཻཌཱུཪྻ། །སྙིང་པོ་འཛམ་བུ་ཆུ་ཀླུང་གསེར་ལས་བགྱིས། །
en: Its leaves were jewels and its stem was beryl, And its pericarp was made of Jambu River gold.

source: སྤོས་མཆོག་རིན་ཆེན་དམ་པའི་ཟེ་བ་ཅན། །འོད་ཆེན་འཛམ་བུའི་རྒྱལ་མཚན་ཀུན་ཏུ་འཕྲོ། །
en: {29} “ ‘It had filaments of aromatic supreme jewels And radiated a great light throughout Jambudhvaja.

source: དེ་ཚེ་དགུང་ལ་གདུགས་ཤིག་ཤར་ཏམ་ཞེས། །སྐྱེ་བོ་ཀུན་ཀྱང་ཡིད་གཉིས་འཚལ་བར་གྱུར། །
en: At that time, all beings were bewildered, wondering, “Has a sun arisen in the middle of the night?”

source: དགུང་སངས་གྱུར་ནས་པད་མོ་ཆེན་པོ་དེ། །
en: {29} “ ‘When the night came to an end, that great lotus And the light of the great sun dawned.

source: གདུགས་ཀྱི་འོད་ཀྱིས་རབ་ཏུ་རྒྱས་བགྱིས་ནས། །སྣང་བ་དེ་དང་སྒྲ་སྙན་རབ་ཀྱང་བཀྱེ། །
en: Together with the light, it emitted melodious sounds.

source: འདི་འབྱུང་དེ་ནི་སྔོན་གྱི་ལྟས་སུ་བྱུང་། །
en: And these were omens of her birth.

source: བུད་མྱེད་རིན་ཆེན་འདི་འདྲ་འཇིག་རྟེན་དུ། །ཚུལ་ཁྲིམས་དམ་པ་རྣམ་པར་དག་པས་བྱུང་། །
en: {31} “ ‘A precious girl such as this was going to appear In this world because of pure, perfect conduct.

source: སུག་ལས་བགྱིས་པ་ཆབ་འཚལ་མི་འགྱུར་བས། །འདི་ནི་སྔོན་ཅད་ལེགས་པར་སྤྱད་པའི་འབྲས། །
en: The karma of one’s previous actions is never lost, And this was the result of her past excellent conduct.

source: སྐྲ་ནི་མཐོན་ཏིང་མིག་ཡངས་ཨུད་པ་ལ། །ཚངས་པའི་དབྱངས་ལྡན་ཁ་དོག་རྣམ་དག་ལྡན། །
en: {32} “ ‘Her hair was deep blue and her wide eyes were blue lotuses; She had the voice of Brahmā and a pure color.

source: ཕྲེང་བ་རྒྱན་མཆོག་ཆ་ལུགས་དབྱིབས་སུ་ཤིས། །དཔལ་ལྟར་དྲི་མྱེད་པད་མོའི་མཆོག་ལས་སྐྱེས། །
en: She was costumed in perfect garlands and jewelry And was born from a lotus, glorious and without stain.

source: ལུས་ནི་རྣམ་དག་ཡན་ལག་རྒྱན་དུ་མཉམ། །
en: {33} “ ‘Her body was pure, all parts in proportion.

source: ལུས་ཀྱི་དབྱིབས་ལེགས་ཡན་ལག་ཡོངས་སུ་ཚང་། །
en: Her body was perfectly shaped, her limbs fully formed.

source: གསེར་གྱི་གཟུགས་ལ་ནོར་བུས་ཕྱིས་པ་འདྲ། །
en: She was like a golden statue adorned with jewels.

source: ཕྱོགས་ཀུན་འོད་ཀྱིས་རྣམ་པར་གདའ་བར་གསལ། །
en: She was shining, illuminating all directions.

source: ལུས་ལས་ཙན་དན་རྒྱལ་པོའི་སྤོས་ཀྱི་དྲི། །ཕྱོགས་སུ་རྒྱས་པར་འདི་ཡི་ལུས་ལས་འབྱུང་། །
en: {34} “ ‘From her body came the aroma of sandalwood, the supreme perfume, Which coming from her body spread in all directions.

source: སྒྲ་སྙན་ལྷ་རྫས་ཡིད་དུ་འོང་བརྗོད་ཚེ། །
en: When she spoke, there were beautiful and divine sounds.

source: ཁ་ནས་ཨུད་པ་ལ་ཡི་ངད་ཀྱང་ལྡང་། །
en: From her mouth came the scent of the blue lotus.
